#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.minecraft_backup will be created
  + resource "aws_iam_access_key" "minecraft_backup" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "kroni-survival-backup-user"
    }

  # aws_iam_access_key.prefect_orchestration will be created
  + resource "aws_iam_access_key" "prefect_orchestration" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "kroni-prefect-orchestration-user"
    }

  # aws_iam_policy.lightsail_snapshot_policy will be created
  + resource "aws_iam_policy" "lightsail_snapshot_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for creating and managing Lightsail snapshots"
      + id               = (known after apply)
      + name             = "kroni-survival-lightsail-snapshot-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lightsail:CreateInstanceSnapshot",
                          + "lightsail:CreateDiskSnapshot",
                          + "lightsail:GetInstanceSnapshot",
                          + "lightsail:GetInstanceSnapshots",
                          + "lightsail:GetDiskSnapshot",
                          + "lightsail:GetDiskSnapshots",
                          + "lightsail:DeleteInstanceSnapshot",
                          + "lightsail:DeleteDiskSnapshot",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "kroni-survival"
        }
    }

  # aws_iam_policy.prefect_orchestration_policy will be created
  + resource "aws_iam_policy" "prefect_orchestration_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for Prefect orchestration"
      + id               = (known after apply)
      + name             = "kroni-prefect-orchestration-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lightsail:GetInstance",
                          + "lightsail:GetInstances",
                          + "lightsail:GetStaticIp",
                          + "lightsail:GetStaticIps",
                          + "lightsail:GetInstanceSnapshot",
                          + "lightsail:GetInstanceSnapshots",
                          + "s3:ListBucket",
                          + "s3:PutObject",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "kroni-survival"
        }
    }

  # aws_iam_policy.s3_backup_policy will be created
  + resource "aws_iam_policy" "s3_backup_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for uploading Minecraft world backups to S3"
      + id               = (known after apply)
      + name             = "kroni-survival-s3-backup-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "kroni-survival"
        }
    }

  # aws_iam_user.minecraft_backup will be created
  + resource "aws_iam_user" "minecraft_backup" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "kroni-survival-backup-user"
      + path          = "/"
      + tags          = {
          + "Name" = "kroni-survival-backup-user"
        }
      + tags_all      = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kroni-survival-backup-user"
          + "Project"     = "kroni-survival"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user.prefect_orchestration will be created
  + resource "aws_iam_user" "prefect_orchestration" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "kroni-prefect-orchestration-user"
      + path          = "/"
      + tags          = {
          + "Name" = "kroni-prefect-orchestration-user"
        }
      + tags_all      = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kroni-prefect-orchestration-user"
          + "Project"     = "kroni-survival"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.lightsail_snapshot_attachment will be created
  + resource "aws_iam_user_policy_attachment" "lightsail_snapshot_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "kroni-survival-backup-user"
    }

  # aws_iam_user_policy_attachment.prefect_orchestration_attachment will be created
  + resource "aws_iam_user_policy_attachment" "prefect_orchestration_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "kroni-prefect-orchestration-user"
    }

  # aws_iam_user_policy_attachment.s3_backup_attachment will be created
  + resource "aws_iam_user_policy_attachment" "s3_backup_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "kroni-survival-backup-user"
    }

  # aws_lightsail_disk.minecraft_data will be created
  + resource "aws_lightsail_disk" "minecraft_data" {
      + arn               = (known after apply)
      + availability_zone = "ap-southeast-1a"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + name              = "kroni-survival-volume"
      + size_in_gb        = 20
      + support_code      = (known after apply)
      + tags              = {
          + "Name" = "kroni-survival-volume"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kroni-survival-volume"
          + "Project"     = "kroni-survival"
        }
    }

  # aws_lightsail_disk_attachment.minecraft_data will be created
  + resource "aws_lightsail_disk_attachment" "minecraft_data" {
      + disk_name     = "kroni-survival-volume"
      + disk_path     = "/dev/xvdf"
      + id            = (known after apply)
      + instance_name = "kroni-survival-server"
    }

  # aws_lightsail_instance.minecraft_server will be created
  + resource "aws_lightsail_instance" "minecraft_server" {
      + arn                = (known after apply)
      + availability_zone  = "ap-southeast-1a"
      + blueprint_id       = "amazon_linux_2"
      + bundle_id          = "small_3_0"
      + cpu_count          = (known after apply)
      + created_at         = (known after apply)
      + id                 = (known after apply)
      + ip_address_type    = "dualstack"
      + ipv6_addresses     = (known after apply)
      + is_static_ip       = (known after apply)
      + key_pair_name      = "kroni-survival-github-action-key"
      + name               = "kroni-survival-server"
      + private_ip_address = (known after apply)
      + public_ip_address  = (known after apply)
      + ram_size           = (known after apply)
      + tags               = {
          + "Name" = "kroni-survival-server"
        }
      + tags_all           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kroni-survival-server"
          + "Project"     = "kroni-survival"
        }
      + username           = (known after apply)
    }

  # aws_lightsail_instance.prefect_orchestration will be created
  + resource "aws_lightsail_instance" "prefect_orchestration" {
      + arn                = (known after apply)
      + availability_zone  = "ap-southeast-1a"
      + blueprint_id       = "amazon_linux_2"
      + bundle_id          = "micro_3_0"
      + cpu_count          = (known after apply)
      + created_at         = (known after apply)
      + id                 = (known after apply)
      + ip_address_type    = "dualstack"
      + ipv6_addresses     = (known after apply)
      + is_static_ip       = (known after apply)
      + key_pair_name      = "kroni-survival-github-action-key"
      + name               = "kroni-survival-prefect-orchestration"
      + private_ip_address = (known after apply)
      + public_ip_address  = (known after apply)
      + ram_size           = (known after apply)
      + tags               = {
          + "Name" = "kroni-prefect-orchestration"
        }
      + tags_all           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kroni-prefect-orchestration"
          + "Project"     = "kroni-survival"
        }
      + username           = (known after apply)
    }

  # aws_lightsail_instance_public_ports.minecraft_server will be created
  + resource "aws_lightsail_instance_public_ports" "minecraft_server" {
      + id            = (known after apply)
      + instance_name = "kroni-survival-server"

      + port_info {
          + cidr_list_aliases = (known after apply)
          + cidrs             = (known after apply)
          + from_port         = 25565
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 25565
        }
      + port_info {
          + cidr_list_aliases = (known after apply)
          + cidrs             = [
              + "0.0.0.0/0",
            ]
          + from_port         = 22
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 22
        }
    }

  # aws_lightsail_instance_public_ports.prefect_orchestration will be created
  + resource "aws_lightsail_instance_public_ports" "prefect_orchestration" {
      + id            = (known after apply)
      + instance_name = "kroni-survival-prefect-orchestration"

      + port_info {
          + cidr_list_aliases = (known after apply)
          + cidrs             = [
              + "0.0.0.0/0",
            ]
          + from_port         = 22
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 22
        }
      + port_info {
          + cidr_list_aliases = (known after apply)
          + cidrs             = [
              + "0.0.0.0/0",
            ]
          + from_port         = 4200
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 4200
        }
    }

  # aws_lightsail_static_ip.minecraft_server will be created
  + resource "aws_lightsail_static_ip" "minecraft_server" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + ip_address   = (known after apply)
      + name         = "kroni-survival-server-static-ip"
      + support_code = (known after apply)
    }

  # aws_lightsail_static_ip.prefect_orchestration will be created
  + resource "aws_lightsail_static_ip" "prefect_orchestration" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + ip_address   = (known after apply)
      + name         = "kroni-prefect-static-ip"
      + support_code = (known after apply)
    }

  # aws_lightsail_static_ip_attachment.minecraft_server will be created
  + resource "aws_lightsail_static_ip_attachment" "minecraft_server" {
      + id             = (known after apply)
      + instance_name  = "kroni-survival-server"
      + ip_address     = (known after apply)
      + static_ip_name = "kroni-survival-server-static-ip"
    }

  # aws_lightsail_static_ip_attachment.prefect_orchestration will be created
  + resource "aws_lightsail_static_ip_attachment" "prefect_orchestration" {
      + id             = (known after apply)
      + instance_name  = "kroni-survival-prefect-orchestration"
      + ip_address     = (known after apply)
      + static_ip_name = "kroni-prefect-static-ip"
    }

  # aws_s3_bucket.minecraft_backups will be created
  + resource "aws_s3_bucket" "minecraft_backups" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "kroni-survival-backups-secure"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "kroni-survival-backups-secure"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kroni-survival-backups-secure"
          + "Project"     = "kroni-survival"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.minecraft_backups will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "minecraft_backups" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-backups"
          + status = "Enabled"

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = false
            }

          + filter {
            }
        }
    }

  # aws_s3_bucket_public_access_block.minecraft_backups will be created
  + resource "aws_s3_bucket_public_access_block" "minecraft_backups" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # null_resource.provision_prefect will be created
  + resource "null_resource" "provision_prefect" {
      + id = (known after apply)
    }

  # null_resource.provision_server will be created
  + resource "null_resource" "provision_server" {
      + id       = (known after apply)
      + triggers = {
          + "disk_attachment" = (known after apply)
          + "instance_id"     = (known after apply)
          + "script_hash"     = (known after apply)
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + backup_schedule            = "0 0 */3 * *"
  + backup_user_access_key     = (sensitive value)
  + backup_user_name           = "kroni-survival-backup-user"
  + minecraft_data_volume_path = "/data"
  + minecraft_server_dns       = (known after apply)
  + minecraft_server_ip        = (known after apply)
  + minecraft_server_port      = 25565
  + minecraft_world_path       = "/data/world"
  + prefect_orchestration_ip   = (known after apply)
  + prefect_ui_url             = (known after apply)
  + s3_backup_bucket           = (known after apply)
  + snapshot_schedule          = "0 0 */14 * *"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @haziqishere, Action: `pull_request`*